* flow control
** loop
*** break and continue in a loop
    | C        | perl |
    |----------+------|
    | break    | last |
    | continue | next |

    exampel:
    #+begin_src perl :results output
    while (1) {
        ++$i;
        next if $i==3;
        print "$i\n";
        last if $i==5;
    }
    #+end_src

    #+RESULTS:
    : 1
    : 2
    : 4
    : 5

** conditional
*** if
    Both the parentheses around the condition and the curly braces {} are required. (A special note for people with background in the C programming language: Even if there is only one statement, that statement needs to be wrapped in a pair of curly braces.)
